<a href="https://colab.research.google.com/github/richardcsuwandi/ppsd-coding-workshop/blob/main/Introduction_to_Data_Analysis_with_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Introduction to Data Analysis with Pandas

By: [Richard Cornelius Suwandi](https://richardcsuwandi.github.io/)

<p align="center">
  <img src="https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1200px-Pandas_logo.svg.png" width=300/>
</p>

## Apa itu Pandas?
Pandas merupakan sebuah package/library dalam Python yang dapat digunakan untuk melakukan data analisis, manipulasi, dan pembersihan data. 

Pandas juga mendukung pembacaan dan penulisan data dengan berbagai format file (seperti `.txt`, `.csv`, dan `.xlsx`) yang kemudian akan dijadikan sebagai objek Python dengan baris dan kolom yang disebut `DataFrame` seperti gambar berikut:

<p align="center">
  <img src="https://pandas.pydata.org/pandas-docs/stable/_images/01_table_dataframe1.svg" width=400/>
</p>

## Menginstall Pandas
Pandas secara default tidak tersedia pada modul standar disaat pertama kali instalasi Python dan kita diharuskan untuk melakukan instalasi terlebih dahulu sebelum menggunakan. Untuk dapat menginstall Pandas, kita bisa menjalankan perintah dengan menggunakan pip

`pip install pandas`

Atau dengan menggunakan library Anaconda, kita bisa menginstallnya dengan perintah berikut

`conda install pandas`

In [ ]:
# Menginstall Pandas
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (1.1.5)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.6/dist-packages (from pandas) (1.19.4)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.6/dist-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
ERROR: Operation cancelled by user

## Menggunakan Pandas
Sebelum kita mulai, mari kita import terlebih dahulu library pandas. Kita melakukan `import pandas as pd` untuk mempermudah penulisan, sehingga kita dapat menulis `pd` sebagai alias dari `pandas`.

In [ ]:
# Import library pandas
import pandas as pd

### Struktur Data di Pandas
Pandas memiliki dua tipe struktur data:
- Series
- DataFrame


#### **Series**
Series merupakan struktur data dasar dalam Pandas. Series bisa juga diibaratkan sebagai array satu dimensi yang mempunyai index sehingga kita dapat mengontrol index dari setiap elemen tersebut. 

Struktur data yang bisa ditampung berupa integer, float, dan juga string. Series juga mendukung operasi vektor.

#### **DataFrame**
DataFrame merupakan array dua dimensi dengan baris dan kolom. Struktur data ini merupakan cara paling standar untuk menyimpan data. Setiap kolom pada Data Frame merupakan objek dari Series, dan baris terdiri dari elemen yang ada pada Series.

Baris berguna untuk menyimpan informasi dan kolom untuk menyimpan nama dari informasi tersebut. Sebagai contoh, berikut adalah perbandingan antara Series dan Data Frame:

<p align="center">
  <img src="https://petruknisme.com/wp-content/uploads/2019/04/series-and-dataframe.width-1200.png" width=600 />
</p>

#### Membuat Series di Pandas
Series pada Pandas bisa dibuat dengan menggunakan fungsi `pd.Series`. Kita bisa menggunakan Python list ataupun NumPy array sebagai data untuk membuat Series. Berbeda dengan Python list, Series hanya dapat berisi data dengan tipe yang sama

In [ ]:
# Series dengan data
data = ["a", "b", "c", "d"]
series = pd.Series(data)
series

0    a
1    b
2    c
3    d
dtype: object

Kita bisa mengakses data pada Series menggunakan indeks seperti halnya pada Python list

In [ ]:
# Akses data dengan indeks
series[0]

'a'

Seperti halnya Python list, Pandas juga mendukung operasi slicing dengan format `start:stop:step`

In [ ]:
# Data dari indeks 0 hingga 4 dengan step 2
series[0:4:2]

0    a
2    c
dtype: object

In [ ]:
# Data dari indeks ke-2 dan setelahnya
series[2:]

2    c
3    d
dtype: object

In [ ]:
# Data sebelum indeks ke-3
series[:3]

0    a
1    b
2    c
dtype: object

Untuk menampilkan data dengan indeks berbeda, kita bisa menggunakan *multi-indexing*

In [ ]:
# Data pada indeks 0 dan 3
series[[0,3]]

0    a
3    d
dtype: object

#### Membuat DataFrame di Pandas
DataFrame pada Pandas bisa dibuat dengan menggunakan method `pd.DataFrame`. Kita bisa menggunakan Python dictionary sebagai data untuk membuat DataFrame

In [ ]:
# Membuat DataFrame
data = {"Negara": ["Indonesia", "Jepang", "India"],
        "Ibukota": ["Jakarta", "Tokyo", "New Delhi"]}

df = pd.DataFrame(data)
df

      Negara    Ibukota
0  Indonesia    Jakarta
1     Jepang      Tokyo
2      India  New Delhi

#### **Latihan**
Gunakan Pandas DataFrame untuk membuat tabel seperi berikut:

|Nama  |Usia|Jenis Kelamin |
|------|----|-------------|
|John  |20  |Laki-Laki    |
|Emily |18  |Perempuan    |
|Anna  |17  |Perempuan    |
|Kevin |21  |Laki-Laki    |

In [ ]:
# Jawaban:
data = {"Nama": ["John", "Emily", "Anna", "Kevin"],
        "Usia": [20, 18, 17, 21],
        "Jenis Kelamin": ["Laki-Laki", "Perempuan", "Perempuan", "Laki-Laki"]}

df = pd.DataFrame(data)
df

    Nama  Usia Jenis Kelamin
0   John    20     Laki-Laki
1  Emily    18     Perempuan
2   Anna    17     Perempuan
3  Kevin    21     Laki-Laki

### Membaca Data di Pandas
Kita dapat membaca file dengan menggunakan fungsi `pd.read_<file type>`. Sebagai contoh, untuk membaca file .csv kita dapat menggunakan fungsi `pd.read_csv`

Baca lebih lanjut: https://pandas.pydata.org/pandas-docs/stable/reference/io.html

Kita akan menggunakan data Titanic dari [Kaggle](https://www.kaggle.com/c/titanic/data), yang berisi informasi mengenai penumpang kapal Titanic.

<p align="center">
  <img src="https://miro.medium.com/max/945/1*jbSpcYChTyfeT1fmr9AHAQ.png" width=600 />
</p>

Data juga bisa di download melalui GitHub saya [disini](https://github.com/richardcsuwandi/datasets/blob/master/titanic.csv)

In [ ]:
  # Membaca data
  url = "https://raw.githubusercontent.com/richardcsuwandi/datasets/master/titanic.csv"
  df = pd.read_csv(url)
  df

     PassengerId  ... Survived
0              1  ...        0
1              2  ...        1
2              3  ...        1
3              4  ...        1
4              5  ...        0
..           ...  ...      ...
886          887  ...        0
887          888  ...        1
888          889  ...        0
889          890  ...        1
890          891  ...        0

[891 rows x 12 columns]

### Melihat Data
Berikut adalah beberapa fungsi dasar untuk melihat data di Pandas:
- `head(n)` : Berfungsi untuk melihat data sebanyak n pada kolom awal (jika tidak diisi, secara default n = 5).
- `tail(n)` : Berfungsi untuk melihat data sebanyak n pada kolom akhie (jika tidak diisi, secara default n = 5).
- `shape` : Melihat jumlah baris dan kolom.
- `info()` : Nomor index beserta tipe datanya.
- `describe()` : Menunjukkan rangkuman statistik seperti rata-rata, median, dll pada kolom.

In [ ]:
# Menggunakan head
df.head()

   PassengerId  ... Survived
0            1  ...        0
1            2  ...        1
2            3  ...        1
3            4  ...        1
4            5  ...        0

[5 rows x 12 columns]

In [ ]:
# Menggunakan tail
df.tail()

     PassengerId                                      Name  ...  Embarked Survived
886          887                     Montvila, Rev. Juozas  ...         S        0
887          888              Graham, Miss. Margaret Edith  ...         S        1
888          889  Johnston, Miss. Catherine Helen "Carrie"  ...         S        0
889          890                     Behr, Mr. Karl Howell  ...         C        1
890          891                       Dooley, Mr. Patrick  ...         Q        0

[5 rows x 12 columns]

In [ ]:
# Menggunakan shape
df.shape

(891, 12)

In [ ]:
# Menggunakan info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Name         891 non-null    object
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
 11  Survived     891 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
# Menggunakan describe
df.describe()

       PassengerId      Pclass         Age  ...       Parch        Fare    Survived
count   891.000000  891.000000  714.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    2.308642   29.699118  ...    0.381594   32.204208    0.383838
std     257.353842    0.836071   14.526497  ...    0.806057   49.693429    0.486592
min       1.000000    1.000000    0.420000  ...    0.000000    0.000000    0.000000
25%     223.500000    2.000000   20.125000  ...    0.000000    7.910400    0.000000
50%     446.000000    3.000000   28.000000  ...    0.000000   14.454200    0.000000
75%     668.500000    3.000000   38.000000  ...    0.000000   31.000000    1.000000
max     891.000000    3.000000   80.000000  ...    6.000000  512.329200    1.000000

[8 rows x 7 columns]

### Memilih Baris dan Kolom

Terdapat dua metode untuk memilih baris dan kolom di Pandas, yaitu menggunakan `iloc` dan `loc`. Secara singkat, `iloc` memilih data berdasarkan indeks/posisi nya, sedangkan `loc` memilih data berdasarkan dengan labelnya.

#### iloc
Kita dapat memilih baris dan kolom dengan `iloc` menggunakan syntax seperti berikut:

`df.iloc[indeks baris, indeks kolom]`

In [ ]:
# Memilih baris dan kolom menggunakan iloc
df.iloc[0, 1]

'Braund, Mr. Owen Harris'

In [ ]:
# Memilih baris menggunakan iloc
df.iloc[0]

PassengerId                          1
Name           Braund, Mr. Owen Harris
Pclass                               3
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Survived                             0
Name: 0, dtype: object

In [ ]:
# Memilih kolom menggunakan iloc
df.iloc[:, 0]

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

In [ ]:
# Memilih beberapa baris dan kolom menggunakan iloc
df.iloc[0:5, [1,3,4]]

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                           Allen, Mr. William Henry    male  35.0

#### loc
Kita dapat memilih baris dan kolom dengan `loc` menggunakan syntax seperti berikut:

`df.loc[indeks baris, nama kolom]`

In [ ]:
# Memilih baris dan kolom menggunakan loc
df.loc[0, "Name"]

'Braund, Mr. Owen Harris'

In [ ]:
# Memilih kolom menggunakan loc
df.loc[:, "Name"]

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [ ]:
# Memilih beberapa baris dan kolom menggunakan loc
df.loc[0:4, ["Name", "Sex", "Age"]]

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                           Allen, Mr. William Henry    male  35.0

Note: `iloc` menggunakan aturan indexing yang sama dengan Python dimana elemen pertama pada range diikutkan sedangkan elemen terakhir tidak diikutkan Sehingga untuk range `0:10`, `iloc` akan memilih  elemen 0,...,9. 

Sedangkan, `loc` mengikutsertakan elemen terakhir pada range sehingga untuk range `0:10` yang dipilih adalah elemen 0,...,10.

#### **Latihan**
Gunakan `iloc` atau `loc` untuk memilih 100 baris pertama dengan kolom `Name`, `Age`, `Sex` dan `Survived`

In [ ]:
# Jawaban
df.loc[:99, ["Name", "Age", "Sex", "Survived"]]

                                                 Name   Age     Sex  Survived
0                             Braund, Mr. Owen Harris  22.0    male         0
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female         1
2                              Heikkinen, Miss. Laina  26.0  female         1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female         1
4                            Allen, Mr. William Henry  35.0    male         0
..                                                ...   ...     ...       ...
95                        Shorney, Mr. Charles Joseph   NaN    male         0
96                          Goldschmidt, Mr. George B  71.0    male         0
97                    Greenfield, Mr. William Bertram  23.0    male         1
98               Doling, Mrs. John T (Ada Julia Bone)  34.0  female         1
99                                  Kantor, Mr. Sinai  34.0    male         0

[100 rows x 4 columns]

### Memfilter Data di Pandas
Kita bisa memfilter atau memilih data berdasarkan kondisi. Beberapa orang menyebutnya *Boolean Selection* atau *Boolean Indexing* karena kita menggunakan logika yang sama seperti ketika kita ingin membuat kondisi pada if else.

In [ ]:
# Data dengan jenis kelamin female
df["Sex"] == "female"

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888     True
889    False
890    False
Name: Sex, Length: 891, dtype: bool

In [ ]:
# Memfilter data berdasarkan jenis kelamin
kondisi = df["Sex"] == "female"
df[kondisi]

     PassengerId  ... Survived
1              2  ...        1
2              3  ...        1
3              4  ...        1
8              9  ...        1
9             10  ...        1
..           ...  ...      ...
880          881  ...        1
882          883  ...        0
885          886  ...        0
887          888  ...        1
888          889  ...        0

[314 rows x 12 columns]

In [ ]:
# Memfilter data berdasarkan usia
kondisi = df["Age"] > 20
df[kondisi]

     PassengerId  ... Survived
0              1  ...        0
1              2  ...        1
2              3  ...        1
3              4  ...        1
4              5  ...        0
..           ...  ...      ...
884          885  ...        0
885          886  ...        0
886          887  ...        0
889          890  ...        1
890          891  ...        0

[535 rows x 12 columns]

Kita juga dapat menggunakan lebih dari satu kondisi:
- Simbol `&` untuk `dan`
- Simbol `|` untuk `atau`

In [ ]:
# Memfilter data berdasarkan jenis kelamin dan usia
kondisi = (df["Sex"] == "female") & (df["Age"] > 20)
df[kondisi]

     PassengerId  ... Survived
1              2  ...        1
2              3  ...        1
3              4  ...        1
8              9  ...        1
11            12  ...        1
..           ...  ...      ...
874          875  ...        1
879          880  ...        1
880          881  ...        1
882          883  ...        0
885          886  ...        0

[184 rows x 12 columns]

Kita dapat menggunakan fungsi `isin` untuk memilih data yang nilainya terdapat dalam sebuah list.

In [ ]:
# Menggunakan isin
kondisi = df["Pclass"].isin([1, 2])
df[kondisi]

     PassengerId  ... Survived
1              2  ...        1
3              4  ...        1
6              7  ...        0
9             10  ...        1
11            12  ...        1
..           ...  ...      ...
880          881  ...        1
883          884  ...        0
886          887  ...        0
887          888  ...        1
889          890  ...        1

[400 rows x 12 columns]

#### Sorting dan Grouping
Kita melakukan sorting data dengan menggunakan function `sort_values` pada Pandas

In [ ]:
# Sort data berdasarkan 1 kolom
df.sort_values(by = "Fare")

     PassengerId                                Name  ...  Embarked Survived
271          272        Tornquist, Mr. William Henry  ...         S        1
597          598                 Johnson, Mr. Alfred  ...         S        0
302          303     Johnson, Mr. William Cahoone Jr  ...         S        0
633          634       Parr, Mr. William Henry Marsh  ...         S        0
277          278         Parkes, Mr. Francis "Frank"  ...         S        0
..           ...                                 ...  ...       ...      ...
438          439                   Fortune, Mr. Mark  ...         S        0
341          342      Fortune, Miss. Alice Elizabeth  ...         S        1
737          738              Lesurer, Mr. Gustave J  ...         C        1
258          259                    Ward, Miss. Anna  ...         C        1
679          680  Cardeza, Mr. Thomas Drake Martinez  ...         C        1

[891 rows x 12 columns]

Secara default, data akan diurutkan dari nilai yang rendah ke tinggi (secara ascending). Akan tetapi, kita juga dapat mengurutkan data dari tinggi ke rendah (descending) dengan cara menambahkan argumen `ascending = False`

In [ ]:
# Sort data secara descending
df.sort_values(by="Fare", ascending=False)

     PassengerId                                Name  ...  Embarked Survived
258          259                    Ward, Miss. Anna  ...         C        1
737          738              Lesurer, Mr. Gustave J  ...         C        1
679          680  Cardeza, Mr. Thomas Drake Martinez  ...         C        1
88            89          Fortune, Miss. Mabel Helen  ...         S        1
27            28      Fortune, Mr. Charles Alexander  ...         S        0
..           ...                                 ...  ...       ...      ...
633          634       Parr, Mr. William Henry Marsh  ...         S        0
413          414      Cunningham, Mr. Alfred Fleming  ...         S        0
822          823     Reuchlin, Jonkheer. John George  ...         S        0
732          733                Knight, Mr. Robert J  ...         S        0
674          675          Watson, Mr. Ennis Hastings  ...         S        0

[891 rows x 12 columns]

In [ ]:
# Sort data berdasarkan beberapa kolom
df.sort_values(by=["Age", "Fare"], ascending=False)

     PassengerId                                  Name  ...  Embarked Survived
630          631  Barkworth, Mr. Algernon Henry Wilson  ...         S        1
851          852                   Svensson, Mr. Johan  ...         S        0
493          494               Artagaveytia, Mr. Ramon  ...         C        0
96            97             Goldschmidt, Mr. George B  ...         C        0
116          117                  Connors, Mr. Patrick  ...         Q        0
..           ...                                   ...  ...       ...      ...
481          482      Frost, Mr. Anthony Wood "Archie"  ...         S        0
633          634         Parr, Mr. William Henry Marsh  ...         S        0
674          675            Watson, Mr. Ennis Hastings  ...         S        0
732          733                  Knight, Mr. Robert J  ...         S        0
815          816                      Fry, Mr. Richard  ...         S        0

[891 rows x 12 columns]

Di Pandas, kita juga dapat melakukan pengelompokan data berdasarkan kolom tertentu menggunakan fungsi `groupby`

In [ ]:
# Grouping berdasarkan jenis kelamin
df_by_sex = df.groupby("Sex")
df_by_sex

Setelah melakukan grouping, kita akan mendapatkan `DataFrameGroupBy object` yang dapat kita gunakan untuk melakukan berbagai analisis dan perhitungan statistik

In [ ]:
# Menghitung jumlah masing-masing kategori
df_by_sex.count()

        PassengerId  Name  Pclass  Age  ...  Fare  Cabin  Embarked  Survived
Sex                                     ...
female          314   314     314  261  ...   314     97       312       314
male            577   577     577  453  ...   577    107       577       577

[2 rows x 11 columns]

In [ ]:
# Menghitung rata-rata masing-masing kategori
df_by_sex.mean()

        PassengerId    Pclass        Age  ...     Parch       Fare  Survived
Sex                                       ...
female   431.028662  2.159236  27.915709  ...  0.649682  44.479818  0.742038
male     454.147314  2.389948  30.726645  ...  0.235702  25.523893  0.188908

[2 rows x 7 columns]

In [ ]:
# Menghitung nilai maksimum
df_by_sex["Age"].max()

Sex
female    63.0
male      80.0
Name: Age, dtype: float64

In [ ]:
# Menghitung nilai maksimum
df_by_sex["Age"].min()

Sex
female    0.75
male      0.42
Name: Age, dtype: float64

Kita juga dapat melakukan beberapa perhitungan sekaligus menggunakan fungsi `agg`

In [ ]:
df_by_sex["Age"].agg(["mean", "max", "min"])

             mean   max   min
Sex
female  27.915709  63.0  0.75
male    30.726645  80.0  0.42

#### **Latihan**
Berapakah nilai minimum, maksimum, dan rata-rata usia untuk setiap kategori `Pclass`?

In [ ]:
# Jawaban
df_by_pclass = df.groupby("Pclass")
df_by_pclass["Age"].agg(["min", "max", "mean"])

         min   max       mean
Pclass
1       0.92  80.0  38.233441
2       0.67  70.0  29.877630
3       0.42  74.0  25.140620

References:
- https://pandas.pydata.org/pandas-docs/stable/getting_started/index.html
- https://www.kaggle.com/learn/pandas